app/controllers/school_classes_controller.rb

	  def create
		@school_class = SchoolClass.new(school_class_params(:title, :description))
		@school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "spelling"], ["room_number", 1000023], ["created_at", "2019-11-06 01:04:57.726895"], ["updated_at", "2019-11-06 01:04:57.726895"]]

	  def update
		@school_class = SchoolClass.find(params[:id])
		@school_class.update(school_class_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "misspelling"], ["updated_at", "2019-11-06 01:13:14.798017"], ["id", 3]]