app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "jennifer"], ["last_name", "yennifer"], ["created_at", "2019-11-06 01:07:53.548149"], ["updated_at", "2019-11-06 01:07:53.548149"]]
---
    def create
        @student = Student.new(post_params(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "THE Destroyer"], ["updated_at", "2019-11-06 01:12:56.233759"], ["id", 4]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(post_params(:first_name, :last_name))